[
  {
    "name": "Alex the Astronaut",
    "id": 1119730,
    "instagram_name": null,
    "alternate_names": [
      "Alex Lynn",
      "Alexandra Francis Lynn",
      "Alexandra Lynn"
    ],
    "description": {
      "plain": "A talented soccer player, Alex Lynn moved from Sydney to New York on a soccer scholarship in 2017 and studied Math and Physics at Long Island University. It was while they were in the US that they turned a streak of bold new life experiences into heart-swelling, folk-inflected pop songs under the name Alex the Astronaut. Their debut album The Theory of Absolutely Nothing follows two acclaimed EPs (To Whom It May Concern and See You Soon, both released in 2017) and a slew of big singles, which have had a way of landing at just the right moment. The track that started it all was 2016’s “Already Home,” which contains the now-iconic line “And there’s billionaires for presidents / And parking fines at hospitals.”\n\nThe following year, Alex returned with “Not Worth Hiding,” an open letter to their 16-year-old self that details the journey to owning their sexuality, which arrived as Australia was debating marriage equality and became the unofficial anthem of the Vote Yes movement. It was played by none other than Elton John on his Beats 1 radio show and ranked at number 23 in tastemaker radio station triple j’s Hottest 100, the publicly voted poll of the best songs of the year.\n\nAlong the way, Alex has taken their music to the stages of international festivals like The UK’s Great Escape, Primavera Sound in Spain and Manchester’s Neighbourhood Festival. At home in Australia, they’ve played Splendour in the Grass, triple j’s One Night Stand and a sold-out national headline tour of their own.\n\nhttp://www.nettwerk.com/news/2020/alex-astronaut-announces-anticipated-debut-album-theory-absolutely-nothing-out-aug-21-new"
    },
    "image_url": "https://images.genius.com/9e95cecd34cd864c65189a46626916ba.579x579x1.png"
  }
]