[
  {
    "name": "Aoife O’Donovan",
    "id": 343914,
    "instagram_name": null,
    "alternate_names": [],
    "description": {
      "plain": "Aoife O'Donovan is an Irish-American singer and songwriter from Newton, Massachusetts.\n\nO'Donovan made her musical debut as a forming member of the popular progressive bluegrass band Crooked Still in 2002, while studying at the New England Conservatory of Music. Crooked Still went on to tour worldwide in the following years, as well as releasing four full-length studio albums with O'Donovan as their lead singer.\n\nIn 2005, O'Donovan joined with fellow singer-songwriters Kristin Andreassen (Uncle Earl, The Jolly Bankers) and Ruth Ungar Merenda (The Mammals, Jay Ungar & Molly Mason’s Family Band) to form contemporary/neo-traditional folk-noir trio Sometymes Why. Sometymes Why released their debut cd, self-titled “Sometymes Why” in 2005, followed by “Your Heart Is A Glorious Machine” in 2009.\n\nIn 2010, O'Donovan released her first solo recording, Blue Light, in the form of a limited edition vinyl. Two years later, she signed a deal with Yep Roc Records and released a single, “Red & White & Blue & Gold”, on April 2, 2013, followed by the release of her full-length debut album, “Fossils”, produced by Tucker Martine, on June 11, 2013. In 2016, Aoife released her sophomore album, titled “In The Magic Hour”. Later that year, she also released the live album “Man In A Neon Coat: Live From Cambridge”.\n\nDuring the three years between her solo albums, O'Donovan toured extensively with Sara Watkins (a founding member of Nickel Creek) and Sarah Jarosz under the combined tour banner of “I’m With Her”. This trio came about after an impromptu performance at the 2014 Telluride Bluegrass Festival. I’m With Her released their debut album, “See You Around” on Rounder Records in 2018.\n\nO'Donovan was also notably a guest vocalist on 2013 Grammy winning album “The Goat Rodeo Sessions” (2011 Sony Masterworks), recorded by cellist Yo-Yo Ma (United Nations Messenger of Peace, recipient of a Presidential Medal of Freedom), bassist Edgar Meyer, mandolinist Chris Thile (Nickel Creek, Punch Brothers), and fiddler Stuart Duncan (Nashville Bluegrass Band). The album includes two vocal tracks featuring O'Donovan and Chris Thile. O'Donovan co-wrote one of those tracks, “Here And Heaven”, with Meyer, Thile, and Duncan."
    },
    "image_url": "https://images.genius.com/5e7d50e2703145b30a3ee2d7a399f143.506x506x1.jpg"
  }
]