[
  {
    "name": "Beach Bunny",
    "id": 1231496,
    "instagram_name": "beachbunnymusic",
    "alternate_names": [],
    "description": {
      "plain": "Beach Bunny is a Chicago-based indie pop band founded by Lili Trifilio in 2015. Initially Trifilio’s solo project and stage name, she expanded the project to a full four-piece band in 2017, featuring Matt Henkels (guitar), Jonathan Alvarado (drums), and Aidan Cada (bass). This lineup performs both live and on studio recordings. Aidan Cada would be replaced by Anthony Vaccaro in 2019.\n\nIn their own words, Beach Bunny is best described as “sad surf honey tries to ride the biggest wave in the Midwest”.\n\nThe project has released a total of five EPs and two full-length albums. The first two EPs, Animalism and Pool Party, were solo acoustic releases by Trifilio, recorded at home on acoustic guitar and ukulele. The third EP Crybaby featured drums added by Trifilio’s friend Ryan Adams, and shortly after this release, the project was expanded to a full band.\n\nBeach Bunny saw their greatest success beginning with their fourth EP Prom Queen, with its title track becoming a viral trend on TikTok. After signing to Mom + Pop Music in October 2019, the band’s first full-length album, Honeymoon, followed on Valentine’s Day 2020. In November 2020, the band released a new single titled “Good Girls (Don’t Get Used)”, and announced their fifth EP, Blame Game, which was released in January 2021.\n\nIn October 2021, the band released the single “Oxygen”. This was followed by the single “Fire Escape” in March 2022, along with the announcement of their sophomore album Emotional Creature, releasing in July 2022. Three more singles were released leading up to the album – “Karaoke”, “Entropy”, and “Weeds” – with music videos that formed a sci-fi trilogy conceptualized and written by Trifilio."
    },
    "image_url": "https://images.genius.com/e8be1d7ae2f9fd6c6f954a46850ee3e1.640x640x1.jpg"
  }
]