[
  {
    "name": "BENEE",
    "id": 1279689,
    "instagram_name": "beneemusic",
    "alternate_names": [
      "Stella R. Bennett",
      "Stella Bennett",
      "Stella Rose Bennett"
    ],
    "description": {
      "plain": "Stella Rose Bennett (born 30 January 2000), known professionally as BENEE (formerly Bene), is a New Zealand singer-songwriter who debuted in December 2017 with “Tough Guy.” Music had always been part of her life, with a family history in theatre. BENEE’s first instrument was a saxophone, playing it for several years, along with the guitar.\n\nBENEE started posting music to Soundcloud in her final year of high school (2017), catching the attention of producer Josh Fountain. The pair went on the work together in several of her singles, including break-out single “Soaked” which was featured on triple j’s hottest 100 (2018).\n\nAfter spending two weeks in a communications course at the Auckland Institute of Technology, Benee realised she wanted to be making music full-time.\n\nFinding her moniker was a struggle, as she explained to Neck Of The Woods:\n\nI needed something that stood out but was personal as well. So it’s simply just part of a nickname that I’ve always had spelt differently which is taken from my last name. Turns out it also means well and good in Latin which is kinda funky.\n\nBENEE’s debut single, FIRE ON MARZZ was released in June 2019, and featured four previously released singles, alongside two new tracks. This was followed by a second EP, in November 2020, which included a feature from tourmate Jack Berry and American musician Gus Dapperton.\n\nHer song “Supalonely” went viral on Tiktok in March 2020, becoming BENEE’s first song on the Billboard Hot 100, peaking at #39.\n\nIn May 2020, BENEE released a second version of the song, without Gus, titled “Lownely” and offering a more stripped back production. A month later, BENEE joined forces with Bakar and Kenny Beats to create “Night Garden”. The track was debuted on Apple Music in celebration of BENEE being named as their Up Next artist of the month."
    },
    "image_url": "https://images.genius.com/681fe97d66ab6514a24d3e9e492874ce.1000x1000x1.png"
  }
]