[
  {
    "name": "Betty Who",
    "id": 163196,
    "instagram_name": "bettywho",
    "alternate_names": [
      "Jessica Anne Newham"
    ],
    "description": {
      "plain": "With an iconic platinum pixie cut and an affinity for anthemic pop music steeped in 80s and 90s nostalgia, it’s fun to hear that Betty Who began her music career as a classical cellist. Born in Sydney, Australia as Jessica Anne Newham, the artist moved to Interlochen, Michigan in 2007 to study music at the town’s acclaimed fine arts high school program. There, she developed an interest in singing and songwriting, a love and talent that ultimately propelled her to Boston’s famous Berklee College of Music, where she met fellow student and producer Peter Thomas. Together, Who and Thomas began shaping her sound over the next few years, graduating from a traditional guitar/piano format to the dreamy, synth-heavy pop sound that eventually became her calling card.\n\nBetty’s initial widespread acclaim and notoriety stemmed from “Somebody Loves You”, her very first track, released in November 2012. The song, which remains her most popular to date, quickly became a success, leading her 2013 debut EP and kick-starting the release of three more EPs over the next two years. It survived to become the main single of her debut solo record in 2014, Take Me When You Go, where positive reception and a viral flash mob proposal video helped the song climb to #1 on Billboard’s Dance Chart.\n\nAfter touring for two years, Who and Thomas dropped a standalone cover of “I Love You Always Forever” in June 2016 to hold fans over until the announcement and release of her sophomore LP. The track became a sleeper hit for Who, leading her to retroactively make it the first promotional single for the upcoming album, The Valley, which was officially announced in February 2017 and released on March 24. The record is an evolution of the themes and sound of Who’s debut, continuing to combine storytelling lyrics with stadium-filling production but focusing on a blunter, refreshingly frank emotional perspective.\n\nIn January 2018, Who released the shimmering, empowering “Ignore Me”. The song signaled a new era both musically and professionally—with the release of the track, she also announced her decision to close her contract with RCA Records, pursuing creative liberty as an independent artist for the first time since her release of The Movement five years prior. In addition to releasing a handful of singles herself, Who spent a few months recording guest features, appearing on soundtracks, and reimagining the Queer Eye theme song for the show’s second season, all culminating in the release of the EP Betty, Pt. 1 on June 15, 2018. The EP was well-received, with LA Weekly calling the collection of tunes “catchy, with hooks galore, but it doesn’t sound at all dumb and disposable. It’s contemporary while simultaneously reminiscent of ’80s pop. Familiar and challenging. And Who is a badass, strong female role model.”\n\nWho continued her musical reintroduction to the world with the announcement of Betty, her third LP, and first independent record. “I wanted to name it Betty because it sort of feels like a restart button for me,” she told Paper Magazine. “It’s the first time where I’m back to the old me, a little bit… I’ve done all this soul searching, and gone through all this change, and I’ve landed in this place where I feel really confident and I feel really engaged.” The album dropped on February 15, 2019, executive produced by her long-time collaborators and friends Peter Thomas and Pretty Sister. The tracks contain a wash of sonic inspiration, ranging from her well-known 80s and 90s pop to acoustic ballads and glittering, ambitious anthems. Underneath it all is Who’s undeniable mastery of the pop form, clearly a result of her devotion and study of the genre: “I want to be the best at this. I love being dedicated to the craft of it, and I think that’s something people don’t think about—I am fascinated and completely enthralled with the process of pop music.”\n\nBetty Who came across her stage name in a lyric from a book of old songs she wrote as a teenager. It now serves as a consistent reminder of her devotion first and foremost to songs that “paint pictures with a hypnotic and heartfelt honesty”, no matter how expansive the scale of her music gets. “It’s about creating songs that feel huge in front of a crowd of 20 or 20,000. I know that I want to get people moving,” Who once said. “When a record moves somebody, that defines success for me.”"
    },
    "image_url": "https://images.genius.com/146d4faf3cac9e18ea049a1c8a43aeca.1000x1000x1.jpg"
  }
]