[
  {
    "name": "Caroline Rose",
    "id": 405478,
    "instagram_name": "carolinerosemuzak",
    "alternate_names": [
      "Caroline Elizabeth Rose"
    ],
    "description": {
      "plain": "Characterized by a deadpan wit, playful and sarcastic tone, and eccentric personality, Caroline Rose is a talented New York-based singer, songwriter, and producer. Rose got her start in the industry, surprisingly, by hosting a GoFundMe to fund her debut: 2012’s America Religious, for which they managed to raise $10,000 of their $7,000 goal. After releasing her second album and first official release, I Will Not Be Afraid, Rose went on an extended hiatus. She returned in 2018 with a new record and an accompanying new sound. Compared to the Americana/folk of her previous two releases, Loner featured much more indie- and pop-influenced production, instrumentation, and even songwriting. In spite of this sharp pivot, Rose’s playful personality effectively shone through on their return record, and because of this, it was recieved largely positively, with even Pitchfork awarding it a 7.6 and several members of the Genius Community naming it on their top albums of that year.\nCaroline built on the momentum from their return record with 2020’s Superstar, a more conceptual and stripped-back album with similar Indie and Pop roots as Loner. She has described it as a concept album about someone who wants to become famous, and features expressive vocals ranging from carefree on tracks such as “Feel the way I want” to almost naïve and needy on “Do You Think We’ll Last Forever?” Superstar was awarded an 81 on metacritic and is a shining example of Caroline’s talent and diversity as a songwriter, dabbling in more disco- and funk-influenced tracks than their previous release, and demonstrating their diverse range.\nIn 2022, Rose released another single, Love/Lover/Friend teasing toward a new album. Sonically, this new album appears to feature yet another pivot to a more orchestrated, ambient style of music, possibly pointing toward a similar style for the upcoming record."
    },
    "image_url": "https://images.genius.com/1088ac42e854c241e5c140d76c441222.1000x1000x1.jpg"
  }
]