[
  {
    "name": "Ethel Cain",
    "id": 1904291,
    "instagram_name": "mothercain",
    "alternate_names": [
      "White Silas",
      "Hayden Silas Anhedönia",
      "Mother Cain"
    ],
    "description": {
      "plain": "Hayden Silas Anhedonia, aka Ethel Cain (formerly White Silas), is an American singer-songwriter originating from North Florida who has been posting her music online since 2018.\n\nBorn on March 24, 1998, Anhedonia grew up in a small Florida town called Perry. The eldest of four kids, she describes her childhood as “simple,” growing up having fun with her siblings and the rest of her community, even though she always felt like the odd one out. After tumultuous teenage years dealing with being LGBT in a conservative town, Anhedonia moved out at 18 and began making music; first under the alias “White Silas” and later, “Ethel Cain.”\n\nIn an interview, Anhedonia stated that the persona of Ethel Cain came about as a culmination of “intersection between my experiences in the heavily religious American South and my dreams of the wild and free American West” the figure embodying the trope of the “unhappy wife of a corrupt preacher.”\n\nIn an interview following the release of her third EP, “Inbred,” she explained some of her reasons for living her life the way she does, stating: “Everything I do through my art is a way to get my thumb on top of what’s happened to me in the past, because now I’m in control and I can’t be hurt by it again.\"\n\nAnhedonia credits a number of artists in the development of her sound including Enya, Kye Kye, Nicole Dollanganger, Daughter, Clams Casino and Title Fight. She has also stated that the music she listened to growing up, such as country, hymns and 90’s Christian synthpop have all had a major impact on her style as an artist."
    },
    "image_url": "https://images.genius.com/79881b8a45a804008dfd6112191a2ad9.1000x1000x1.png"
  }
]