[
  {
    "name": "FELIVAND",
    "id": 1199688,
    "instagram_name": null,
    "alternate_names": [],
    "description": {
      "plain": "Usually found hunched over her laptop or with her head wedged inside her makeshift wardrobe vocal booth, 21 year-old producer/multi-instrumentalist/singer Felicity Vanderveen creates her warm, soulful and earthy tunes. Her introspective music translates in a way that is there for you in the darker and more somber moments, yet simultaneously at the forefront of your mind when someone asks: ‘You want the AUX cord?’\n\nFelicity creates music as FELIVAND, marrying the smooth, neo-soul stylings of Jorja Smith and H.E.R with the organic, DIY textures of artists like Still Woozy and The Internet. Across 2017 and 2018, Felicity gradually let the outside world in on this private sphere of creation, releasing a handful of singles that culminated in her radiant and breezy debut EP, In Bloom. Self-managed and independently released, In Bloom garnered praise from COLORS, triple j, Bandcamp and Apple Music, who named her their New Artist of the Week.\n\nThroughout her second EP, Nerve, the producer, singer and songwriter paints her organic, soul-tinged music in slinkier, darker shades of pop, hiding shadowy and somber depths beneath warm and earthy exteriors. A sonic study in duplicity and contradictions, Nerve represents FELIVAND’s most contemporaneous, true-to-herself release yet, simultaneously expanding her creative horizons while honing in on what she does best – making music for the spaces in between definable moods, those unspeakable, inexpressible moments in life where language can fail you.\n\nIt’s a duplicity which is embedded in the title: Nerve. Audacity, fortitude, apprehension and unease; all meanings coexisting within the one word. On her sophomore EP, FELIVAND captures the motion sickness of fluctuating daily, of containing seemingly opposite possibilities within the one person and not knowing which is correct, of waking up one day feeling as though you could take on the world and waking up the next anxious or uncertain.\nNerve plays like a beguiling trick mirror, reflecting back different images at different moments. Look on one day from a particular angle, and you might hear the soundtrack to long, reflective nights spent spiraling down existential wells; look at it on another day and from another angle, and you might now hear the soundtrack to an endless Summer drive, where the wind courses through your hair and the immeasurable beauty of the world prickles at your senses."
    },
    "image_url": "https://images.genius.com/25f871bd043412baa0b3f71ec968d064.480x480x1.jpg"
  }
]