[
  {
    "name": "Fenne Lily",
    "id": 1005293,
    "instagram_name": "fennelily",
    "alternate_names": [],
    "description": {
      "plain": "Isolation is nothing new for Fenne Lily – in fact, she’s written an album of songs all about it. “It’s kind of like writing a letter, and leaving it in a book that you know you’ll get out when you’re sad – like a message to yourself in the future,” she says, referring to BREACH, her Dead Oceans debut she wrote during a period of self-enforced isolation pre-COVID. It’s an expansive, diaristic, frequently sardonic record that deals with the mess and the catharsis of entering your 20s and finding peace while being alone. “I think this record is proof that I can be emotionally stable, even if right now I feel a little bit up and down,” says Fenne. “There’s the ability to find clarity in that. It’s sobering, weirdly.”\n\nFenne was born in London and moved to Dorset as a toddler, where she grew up in the picturesque English countryside. She was a “free range kid,” as she calls it, after her parents took her out of school for a period at the age of seven. Over the following year, they taught her while the family travelled Europe in a live-in bus. Even after she returned to traditional school at 9, her home education never ended, extending to music. Her mother gifted Fenne with her old record collection, through which she discovered her love for T-Rex and the Velvet Underground and Nico. Soon after she fell for the strange genius of PJ Harvey and came to worship Nick Drake, Joni Mitchell, and the richly crafted worlds of Feist, which inspired Fenne to pick up a guitar.\n\nOn Hold, a tender collection of expressive, open-hearted songs, was Fenne’s first foray into songwriting, written during her teenage years. Writing her own songs was initially a “therapy exercise” for Fenne, who is normally reserved when it comes to talking about her feelings. The album, self-released in 2018, organically found a large audience online, which grew after she opened for Lucy Dacus and Andy Shauf’s North American tours last spring. Surrounding its release, The Line of Best Fit deemed Fenne “a new and extraordinary voice capable of wringing profound and resonant moments out of loss.”\n\nWhere On Hold grappled with love and relationships, BREACH digs deeper into Fenne herself. “I tried to write about my inner life, as opposed to how people affect my life as a third party,” she explains. Written after a disjointed experience of touring Europe, and then spending a month alone in Berlin, the album deals largely with “feeling lonely. And trying to work out the difference between being alone and being lonely.” Although its subject matter is solitude, it sounds bigger and more intricate than anything Fenne previously released. Acclaimed producer Brian Deck, who she recorded with at Chicago’s Narwhal Studios, and Steve Albini (Electrical Audio) helped flesh out her sound with vast, rich guitars.\n\nLead single ‘Alapathy’ is the first taste of a newly upbeat and urgent streak to Fenne’s songwriting. Its insistent percussion mimics the anxious racing thoughts that Fenne deals with as an overthinker and chronicles how she “started smoking weed to switch off [her] brain.” The title is a made-up word that merges ‘apathy’ and ‘allopathic’ (as in Westernized medicine). “Western medicine generally treats the symptoms of an illness rather than the cause,” explains Fenne. For Fenne, taking medication to improve her mental health didn’t solve her problems because she felt like she was only treating the effects of her discomfort, not the reason for it.\n\nElsewhere, there are brighter songs on the album. Fenne wrote hazed-out lo-fi rock song ‘Solipsism’ after watching a documentary about the Stone Roses. She wanted to create “something that sounded cheerful, about something really not cheerful.” The song deals with the anxieties of a social media driven generation, “because everyone is sharing everything, and everyone’s comparing their lives to other people’s.“ She sighs her age (\"twentyyyyy… ohhh”) over the strident surge of guitar fuzz, as she sings about the pressure to have more fun in her 20s, and the solipsism that keeps her awake.\n\nOn slowly unfurling ‘Berlin’, which she describes as her defining moment of the record, Fenne has a hushed-yet-powerful energy. It was written during her time alone in Berlin after her third reading of Patti Smith’s Just Kids, and made a solo voyage to the popular nightclub Berghain. The experience was one of pushing her own boundaries, and the morning after, she woke up and wrote ‘Berlin’, a careful, beautiful declaration celebrating being comfortable being alone.\n\nThe songs that make up BREACH layer Fenne’s own experiences with what she’s learned from others. Initially, ‘Elliott’ was inspired by someone she met in Bristol who turned his back on the allure of being in a rock band to run a hardware shop. As the lyrics started to arrive, the song “became clearly about my dad’s childhood and solidified the record as something chronicling more than my own stories,” says Fenne. ‘Elliott’, with its gentle harmonies, is a peaceful moment that condenses many of the record’s themes: family, the relationship between our child and adult selves, and the decision to follow an isolated, untrodden path.\n\nIt’s that journey to find peace inside herself that underpins the whole of Fenne’s second album. Its title, BREACH, occurred to Fenne after deep conversations with her mum about her birth, during which she was breech, or upside down in the womb. The slippery double-sidedness of the word – which, spelled with an ‘A’, means to “break through” – drew her in. “That feels like what I was doing in this record; I was breaking through a wall that I built for myself, keeping myself safe, and dealing with the downside of feeling lonely and alone. I realized that I am comfortable in myself, and I don’t need to fixate on relationships to make myself feel like I have something to talk about. I felt like I broke through a mental barrier in that respect.” Even though it also carries implications of awkwardness, rebellion, and breakage, it’s a wide-reaching word, representing new beginnings and birth."
    },
    "image_url": "https://images.genius.com/96c4238ec94cd0aaa0d62d4f1bbc82fd.1000x1000x1.jpg"
  }
]