[
  {
    "name": "FKA twigs",
    "id": 63636,
    "instagram_name": "fkatwigs",
    "alternate_names": [
      "Twigs",
      "Tahliah D. Barnett",
      "Tahliah Barnett",
      "Tahliah Debrett Barnett"
    ],
    "description": {
      "plain": "Tahliah Barnett (born 16 January, 1988), known by the stage name FKA twigs (“FKA” is reported, but has been denied, to mean “Formerly Known As”) is a British dancer, director, composer, singer, and producer.\n\nShe got her start in music with ballet and singing on tracks recorded in a Jamaican Club. Her electronically tinged, haunting music is reminiscent of  the work of Björk, Portishead, The xx, Tricky, and Massive Attack.\n\nBefore she had a career in music, she was an extremely sought-after pop-video dancer in London. She has appeared in videos by Taio Cruz, Jessie J, Ed Sheeran, Kylie Minogue and others.\n\nHer first extended play, EP1, was self-released on Bandcamp in 2012 under the stage name “twigs,” referring to the way her joints crack as she dances. EP2 was released the following year under her current stage name after she was forced to change it after the band The Twigs were upset with the similarity of her name to theirs.\n\nFKA twigs then worked with Arca (who also produced EP2), Dev Hynes, Sampha, Paul Epworth and others for her 2014 debut album, LP1.\n\nIn 2015, twigs dropped her third extended play, M3LL155X, which was inspired by a “spontaneous creative period” immediately following the completion of her debut studio album. The extended play, pronounced “Melissa,” is named after her “personal female energy,” but Twigs assures that it is not an alter-ego.\n\nFive years after LP1, twigs returned with a sophomore album, titled MAGDALENE in 2019, after releasing a standalone single, Good To Love in 2016, and being featured on a track with A$AP Rocky, named Fukk Sleep in 2018."
    },
    "image_url": "https://images.genius.com/349995d996a07c44e03d4bc440f0884f.847x847x1.jpg"
  }
]