[
  {
    "name": "Gatlin",
    "id": 1509288,
    "instagram_name": "Gatlin",
    "alternate_names": [
      "Gatlin Thornton"
    ],
    "description": {
      "plain": "Gatlin combines instinctual humanity with daring vulnerability to craft musical moments of meaning and melody. Originally from Orlando, Florida but now splitting her time between Los Angeles and Nashville, Gatlin’s versatility stems from the wide variety of musical scenes that she has immersed herself in. Her music blends confessional lyricism with raw storytelling bringing listeners into her own personal world of emotions. From themes of nostalgic love in “What If I Love You” to feelings of isolation in “Talking To Myself,” Gatlin provides an emotional safe haven for any and all listeners.\n\nNobody has a more natural poise on stage than Gatlin does when she is performing. Her electrifying shows engage a crowd like no other and have earned her opening slots for artists such as Michigander, Bre Kennedy, Jordy Searcy, Vacation Manor, and Okey Dokey. She recently completed a tour as the opening act for The Brook & The Bluff and capped off February opening for Dashboard Confessional in a sold-out show in Los Angeles.\n\nGatlin released her debut EP Sugarcoated in summer 2020, featuring the single, “Talking To Myself,” which has garnered over 5.7 million streams to date. Gatlin’s first releases quickly earned her support across all DSPs including placements on Spotify’s “Fresh Folk,” “Indie Pop,” and “Fresh Finds” as well as Apple Music’s “Acoustic Chill” and “Breaking: Singer/Songwriter” playlists. Her sophomore EP To Remind Me Of Home was released in the summer of 2021, featuring breakout track “What If I Love You.” This release broke through the crowd and led to featured articles in Consequence of Sound, Ones To Watch, and more. Gatlin’s 2022 singles, “2000 Miles” and “Masterclass,” showcase a new era of growth and confidence."
    },
    "image_url": "https://images.genius.com/a15dcf60b6393d4541e1764edd6c9309.400x400x1.jpg"
  }
]