[
  {
    "name": "Hana Vu",
    "id": 1064596,
    "instagram_name": null,
    "alternate_names": [],
    "description": {
      "plain": "Hana Vu writes pop songs from her bedroom in Los Angeles. She signed to Ghostly International in 2021, releasing “Maker,” the first glimpse of new material to come.\n\nVu’s relationship with music began when she picked up a guitar her dad had lying around and taught herself to play. She’d wake up every day and listen to LA’s ALT 98.7, home to ‘90s and '00s alternative rock; later in high school, she found the local DIY scene. She remembers, “A lot of my peer musicians were surf rock/punk type bands and so I tried to fit into that when I was gigging around. But what I was listening to at that time (St. Vincent, Sufjan Stevens) was very different from what I performed.”\n\nIn 2014, at age 14, she started keeping a journal of bedroom pop experiments on Bandcamp. Her sound — brooding, melodic pop driven by guitar and Vu’s distinctive contralto — developed across a series of self-releases, including a low-key WILLOW collaboration and covers of The Cure and Phil Collins. Her 2018 single “Crying on the Subway” caught the ear of Gorilla vs. Bear, who released Vu’s self-produced debut EP, How Many Times Have You Driven By, on their Luminelle Recordings imprint. Early coverage came from Pitchfork, NME, and The Fader, the latter playfully declaring, “the seventeen-year-old is cooler than you and me.” She followed it up with a double EP in 2019 on Luminelle titled Nicole Kidman / Anne Hathaway.\n\nAs a live performer, Vu has supported the likes of Soccer Mommy, SALES, Nilüfer Yanya, Wet, Kilo Kish, and Phantogram. The 2021 single, “Maker,” marks her first release with Ghostly and her first time working with a co-producer, Jackson Phillips (Day Wave)."
    },
    "image_url": "https://images.genius.com/052a641e05fa65c99ef0e3d837855fa4.1000x1000x1.jpg"
  }
]