[
  {
    "name": "JESSIA",
    "id": 1570732,
    "instagram_name": "jessiamusic",
    "alternate_names": [],
    "description": {
      "plain": "She’ll make you laugh. She’ll let you cry. She’ll remind you it gets better. It’s why she has emerged as one of 2021’s most inspiring breakout artists with 30 million streams, 50 million views, and countless TikTok creations in less than a month. Championed by Grammy award winning singer, songwriter, and producer Ryan Tedder, and signed by Artist Driven Records and Republic Records, she instigates a fascinating conversation with her new single “I’m not Pretty.”\n\n“I want all of my songs to feel like you’re sitting down and having a cup of tea with me,” she smiles. “It’s very minimalistic. To me, less is more, and it’s really about the lyrics. I’m talking about my life and my friends’ stories. I’ll be on the phone with somebody and literally stop like, ‘Hold up. I need to write a song about this!’ That’s how it happens.”\n\nVancouver-based JESSIA, started singing before she could talk and by the age of two, had already charmed a crowd at the local legion. With mom as a music teacher, she learned to play the guitar early on and started writing songs at the age of eleven.  Graduating high school early to pursue her dream, she attended University, majoring in vocal performance and broke into the business by penning and performing toplines for electronic artists, most notably on Burgess’ hit “Eclipse.”\n\nThen, in 2019, everything came crashing down. “I hit rock bottom and lost my creative direction and was second guessing myself pursuing music and just becoming a travel agent instead to have a more stable job.”  \n\nAs she walked home one night, something changed.  “I stopped in a park and wrote “Tell Me” singing little voice notes into my phone.” That opened the floodgates and she began writing up to three songs per day.  Inspired by the likes of Julia Michaels and Hayley Williams, she held nothing back.\n\n“For a long time, I only saw myself as a singer,” she continues. “After I was stripped of who I was, I realized I am a songwriter, and I might actually have something to say. So, I started to explore myself as a multidimensional artist.”\n\nAt the top of 2020, she made a pilgrimage to Indonesia and learned what it was like to live life with no restrictions. “I felt like I was living my own version of Eat Pray Love.”  She returned home inspired and refreshed, realizing she was ready to launch her career as an independent artist.  A month later, she released her debut single “Tell Me.” Locking into a prolific groove, she dropped “Conviction” and “Really Nice To Think About” and gained early support from Spotify, gracing coveted playlists such as New Music Friday, It’s A Bop and Amazon’s Ones To Watch 2020.  \n\nOn January 1, 2021, everything changed. Sitting in her car, she introduced an acapella hook for what would become “I’m not Pretty” on TikTok, by admitting, “I don’t know if this is total trash, or if it’s actually a bop.”\n\nTurns out, it was the latter… \n\nThe candid lyrics describe a journey towards self-love and the emotions one can feel while on its path. The song’s message resonated with so many and generated 1 million views in a day. Meanwhile, 4x JUNO Award nominee, singer, songwriter, and producer elijah woods took notice of the initial clip, reached out, and together they finished the song in 48 hours in front of millions by sharing a series of TikTok posts. Produced by woods, the official release hinges on raw acoustic guitar as she sings, “Every other song says I’m beautiful, but what if I don’t feel like I’m beautiful. I wish my body image didn’t say that I should be another kindaway.” It eventually hit  25 million streams in the first month.\n\n“This is about self-love and body acceptance for everyone– all of humanity. I’m singing about eating disorders and personal insecurities. If you’re struggling, definitely ask for help. I want this song to be a tool for people to realize how amazing they are, and how liberating it is to accept yourself.  This song is not meant to seek validation from other people’s opinions. It is about your own relationship with yourself and your own body. It’s an important relationship that is not talked about enough. Be proud of who you are and know sometimes it’s a long journey to get there. Smile at yourself in the mirror, jiggle your belly, and be okay with being a human,” she encourages.\n\nAs “I’m not Pretty” took flight, Ryan Tedder sent a DM and signed JESSIA to Artist Driven Records in partnership with Republic Records, igniting what she calls “A dream come true.” \n\nNow, she’s ready more than ever to have a conversation.\n\n“When you listen to me, I want you to feel like you’re powerful, you’ve been given the tools to love yourself, and feel like you’re not alone,” she leaves off. “I write my songs to get me through the day and it’s like my own personal therapy session. If it helps other people, that is just the cherry on top. I want my songs to talk about the rough stuff and be real. We aren’t perfect and I’m sick of trying to act as though we are. I know my story seems surreal and like a dream, and it kinda is, but to all of those struggling and frustrated artists out there, yeah, it is actually possible.”"
    },
    "image_url": "https://images.genius.com/e0a431acf76be4fca01c0ec394ea63ae.1000x1000x1.jpg"
  }
]