[
  {
    "name": "Katie Gregson-MacLeod",
    "id": 3242513,
    "instagram_name": null,
    "alternate_names": [],
    "description": {
      "plain": "Scottish singer-songwriter Katie Gregson-MacLeod has released her new EP ‘songs written for piano’ and shared the video for latest single ‘white lies’ – check out both below.\n\nThe new five-track EP from the rising artist includes breakout track ‘complex’ along with a live version recorded with a 12-piece string ensemble, in addition to three new tracks.\n\nNew single ‘white lies’, co-written with Matt Maltese, also arrives today (December 2) with a new video.\n\n“I had the idea for this body of work really early on into the process of ‘complex’ being released and all the craziness around it, ” the singer said of her second EP in a statement. “I’ve always wanted to release a stripped back acoustic EP and when ‘complex’ – a song released in demo form first with just piano and vocal – resonated with so many people I felt it was a perfect opportunity to release a body of work that fell within that world sonically and thematically.”\n\nNew single ‘white lies’ tells the story of “growing apart from someone” you once loved, according to a press release. The video finds the singer watching an older couple in love from the sidelines, unable to help herself from the allure of an old-fashioned romance.\n\n“I wanted to talk about the feeling of growing apart from someone you’d not long ago yearned for,” the singer said of the emotive new single. “This is the most recent song on the EP and at the time of writing, I’d been experiencing so many changes to my own life and was the busiest I’d ever been.\n\n“In that process I guess I was feeling detached from my feelings for this person. So when I went in to write with Matt Maltese, the main question that arose was around whether that feeling was a natural result of slowly growing apart or if I had just been really successful at distracting myself.”\n\nShe continued: “I was really chuffed to be writing with Matt, someone I’d looked up to as a writer for a long time, to the point where I didn’t even realise how special the song was until Matt sent over the first demo. We’d just met that day but it was such an honest writing process and the song was finished really quickly. It’s definitely one of my favourite songs I’ve written.”\n\nIn September this year, Gregson-MacLeod signed to Columbia Records after amassing 100,000 views on her 45-second TikTok clip.\n\nAfter posting ‘Complex’ to the app with the caption “here’s my saviour complex” on August 5, the singer woke up the next day to comments from Gracie Abrams, Lennon Stella, and Maisie Peters.\n - NME"
    },
    "image_url": "https://images.genius.com/76ffcbe5fff63eeb60035760f6f2f65c.183x183x1.jpg"
  }
]