[
  {
    "name": "St. Vincent",
    "id": 2373,
    "instagram_name": "st_vincent",
    "alternate_names": [
      "Annie Erin Clark",
      "Annie E. Clark",
      "Annie Clark"
    ],
    "description": {
      "plain": "Annie Clark, better known under her moniker St. Vincent (a Nick Cave reference) , is best described as living between the “intersection of accessible and lunatic”. Her demented sense of style is unrestricted by specific rock subgenre, and set free by the complex contrasts of heavy, deep instrumental entwining with Clark’s angelic vocals.\n\nSince her debut solo album in 2007, Marry Me, Clark built up from her artful indie rock style into increasingly intriguing and fascinating sounds. She signed with the label 4AD for her second release, Actor, which was written as inspired by film scores. Clark proved her great strengths as a composer, but didn’t find the heavy guitar sounds she is now known for until her next album.\n\nStrange Mercy was Clark’s third release, which continued St. Vincent’s upward trend of grittier sounds that arouse sense and emotion. In her Coup de Main Magazine interview, regarding the huge influx of heavy, distorted guitar on Strange Mercy:\n\nWhat I did with my first records was, my writing process was that I didn’t touch any instruments to write it… making it all on the computer. But with [Strange Mercy], I thought: “Okay, I’m gonna take it back to just the simplest  form.”\n\nIn 2012, she released an album along with Talking Heads frontman David Byrne, titled Love This Giant. Clark co-wrote the album, and thought up the idea to heavily rely on brass instrumentation.\n\nHer fourth solo album drew on the brass beats of Love This Giant and her embrace of dirty-distortion guitar from Strange Mercy to form the eponymous St. Vincent. It received huge critical acclaim, finding a spot as the #1 best album of the year by The Guardian, Slant Magazine, and Entertainment Weekly. The album earned Clark her first Grammy for Best Alternative Album of 2014.\n\nA deluxe edition of St. Vincent was released February 9, 2015, which included four new tracks, as well as a remix of “Digital Witness” by Darkside.\n\nHer fifth album, MASSEDUCTION, was released on October 13th, 2017.\n\n– mount"
    },
    "image_url": "https://images.genius.com/e64aa5f8eda440fb56c86a5fbd0d302d.409x409x1.jpg"
  }
]