[
  {
    "name": "Tenci",
    "id": 2472026,
    "instagram_name": "tenci.band",
    "alternate_names": [
      "Jessica Shoman",
      "Jess Shoman"
    ],
    "description": {
      "plain": "A well is a stone-encircled place of depth, keeping an abundance of water for survival. “Well” is also a phrase for pause, for transition in language. Our tears can well up and bubble over. To define ourselves as “well” is the most basic term of goodness.\n\nWhat’s on the other side of the well? Inside the tunnel of change, or this life, we can either feel intimidated by the darkness of uncertainty, or excited by the possibility of nourishment. Songwriter, guitarist, and vocalist Jess Shoman wonders, “what the hell,” why don’t we go for the excess of love we deserve? Tenci’s album A Swollen River, A Well Overflowing becomes a gathering and collection of well-like vessels – cups, puddles, fists – to hold tight to this love and newfound joy.\n\nA Swollen River, A Well Overflowing is Tenci’s second album, coming after their 2020 debut My Heart Is An Open Field, which introduced Jess Shoman’s music explorations to the world. Shoman admits that their first album dealt with letting go of painful life experiences, resulting in emptiness. In this recent collection of wiser years and distance from that former grief, Tenci carries an opposite feeling, a celebration of self-rejuvenation. A Swollen River, A Well Overflowing shows Shoman steering their inventive music further and wilder, spilling over with 12 fable-like songs. In a combination of milk, coins, glass, water, and light, each song forms a spell to “fill my heart back up,” Shoman says, “by reframing complex feelings by turning my head sideways and seeing them in a different way.”\n\nFrom the close-knit Chicago scene, Shoman is joined by Curtis Oren on saxophone and guitar, Izzy Reidy on bass (Izzy True), and Joseph Farago on drums (Joey Nebulous). The years following My Heart is an Open Field saw the band playing shows together all over the country before regrouping in\n\nChicago to record A Swollen River with engineer Abby Black. While the themes of Tenci shuffle around a serious pool of thought, trying to understand life’s calamities, their live sets often feature an ample amount of goofy light-heartedness. Their playful interplay of loose drums and bass, huffing sax, and vocal waterfalls leave us warmer than before. The songs on A Swollen River, A Well Overflowing weave together like twigs to create that fire, a burning message to keep going."
    },
    "image_url": "https://images.genius.com/a6bc36d55ba200edb8d08af22475074d.529x529x1.jpg"
  }
]