[
  {
    "name": "Vera Blue",
    "id": 648590,
    "instagram_name": "verabluemusic",
    "alternate_names": [],
    "description": {
      "plain": "Vera Blue is the alias of Australian singer/songwriter Celia Pavey known for songs such as ‘'Hold’', the hit single ‘'Papercuts’' with Illy and ‘'Regular Touch’'.\n\nAfter finishing third in season 2 of The Voice Australia she released in 2013 under her real name her first album This Music that included covers of other songs and an original song, ‘'Candle In The Night’‘ . She also released in 2014 a folk-inspired EP, Bodies.\n\nShe launched her new artist project under the name of Vera Blue with the release of Fingertips EP in 2016. The extended play included two of her most popular singles ‘'Hold’' and ‘'Settle’'.\n\nShe explained that she chose Vera after Vera Wang, creator of the first perfume she wore as a teenager, and Blue because it’s an old Australian nickname for redheads, her family’s hair color.\n\n“I did ‘The Voice’ as Celia, but afterward I was going through a phase where I was listening to a lot of electronic music, like Alt-J and Banks, and I felt like blending the two genres together would really enhance the emotion in my songs, and I felt like I should give the project a name.”\n\nVera Blue released her debut album Perennial on July 21, 2017.\n\n\n‘'Perennial is a term for plants that come back year after year, and I like to relate that to memory, feelings, and emotions.\n\nIt’s what the record is all about; relationships can be very cyclical, or never-ending, but that isn’t necessarily a bad thing. It’s just part of life''\n\n\nThe alternative pop and electro-folk album includes the lead single “Private”, the hit singles Regular Touch'' and ‘'Mended’' and also the solo version of her latest single ‘'Lady Powers’' featuring Kodie Shane.\n\n\n\nVera Blue collaborated with Flume for “Rushing Back” which gained #2 on the Triple J Hottest 100 in January 2020."
    },
    "image_url": "https://images.genius.com/0f2f9acea0efcf236fb92fce0ca60445.1000x1000x1.jpg"
  }
]