[
  {
    "name": "WILLOW",
    "id": 12224,
    "instagram_name": "willowsmith",
    "alternate_names": [
      "Willow C. R. Smith",
      "Willow Camille Reign Smith",
      "Willow Smith",
      "Wilough"
    ],
    "description": {
      "plain": "Willow Camille Reign Smith (b. October 31, 2000) is an American singer, actress, songwriter, model and activist. She is the daughter of Will Smith and Jada Pinkett Smith, and the younger sister of Jaden Smith, who also performs mononymously as Jaden, and Trey Smith.\n\nSmith launched her aspiring music career in the autumn of 2010 with the release of the singles “Whip My Hair” and “21st Century Girl” after signing to her mentor Jay-Z’s record label Roc Nation, becoming the youngest artist signed to the label. “Whip My Hair” peaked at #11 on the Billboard Hot 100. The video was nominated for Video of the Year at the BET Awards of 2011 and garnered over 200 million views.\n\nAside from being a solo artist, Willow is in an electronic-pop-punk duo with her best friend Tyler Cole that started in February 28, 2020, called “THE ANXIETY”.\n\nShe is signed to her brother Jaden’s record label, MSFTS Music. She dropped her sophomore album, The 1st, in 2017 and her eponymous third album in 2019. Willow also independently released multiple songs on her SoundCloud from 2013 to 2018.\n\nIn 2018, she joined her mother Jada Pinkett-Smith and her grandmother Adrienne Banfield-Norris in hosting web television talk show Red Table Talk. The show premise is to show perspectives of three different generations on a wide variety of topics. It won an NAACP Image award for Outstanding Host in a Talk or News.\n\nWILLOW returned in 2021 with her smash single “t r a n s p a r e n t s o u l” featuring legendary Blink-182 drummer Travis Barker, and it beckoned a new era in her music, and later announced that her new album was on the way, and it was largely inspired by her mother’s own nu-metal band, Wicked Wisdom."
    },
    "image_url": "https://images.genius.com/a08c86e1ced206a2bee774f5106d313a.1000x1000x1.jpg"
  }
]